doc/html/index.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Documentation Index</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="<2010-10-21 Wed>"/>
<meta name="author" content="Shrutarshi Basu"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title">Documentation Index</h1>


<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Documentation Index </h2>
<div class="outline-text-2" id="text-1">

<p>The documentation for Metaphor consists of the following parts. Some files link to source code:
</p>
<ol>
<li>
<a href="overview.html">Overview</a> &ndash; Overview of the Metaphor system
</li>
<li>
<a href="background.html">Background</a> &ndash; Concepts, ideas and terminology behind Metaphor
</li>
<li>
<a href="usage.html">Usage</a> &ndash; How to run Metaphor and create L-systems
</li>
<li>
<a href="technical.html">Technical</a> &ndash; Notes about the implementation and organization of Metaphor
</li>
</ol>
</div>
</div>

</div>
</body>
</html>
